[
  [
    75,
    653,
    "2021-06-09,2021-06-13",
    "Attended the 47th G7 summit. Met with Queen Elizabeth II at Windsor Castle and Prime Minister Boris Johnson. Both Biden and Johnson would issue a revision of the Atlantic Charter which had previously been issued by Franklin Roosevelt and Winston Churchill eighty years prior."
  ],
  [
    75,
    40,
    "2021-06-13,2021-06-15",
    "Attended the 31st NATO summit. Met with King Philippe and Prime Minister Alexander De Croo. Held multilateral meetings with the leaders of the Baltic States, Secretary General of NATO Jens Stoltenberg, and Turkish President Recep Erdoğan. Also participated in an EU–U.S. summit with European Council president Charles Michel and European Commission president Ursula von der Leyen at the Europa Building."
  ],
  [
    75,
    39,
    "2021-06-15,2021-06-16",
    "Attended the summit meeting with Russian President Vladimir Putin at Villa La Grange. Held a bilateral meeting with Swiss President Guy Parmelin and Swiss Foreign Minister Ignazio Cassis"
  ],
  [
    75,
    9,
    "2021-10-29,",
    "The President and First Lady visited and had an audience with Pope Francis. He also held a bilateral meeting with Cardinal Secretary of State Pietro Parolin."
  ],
  [
    75,
    8,
    "2021-10-29,2021-11-01",
    "Held bilateral meetings with Italian President Sergio Mattarella, Italian Prime Minister Mario Draghi, and French President Emmanuel Macron. On October 30, attended the G20 Summit Met with Italian Prime Minister Mario DraghiMet with British Prime Minister Boris Johnson, French President Emmanuel Macron, and outgoing German Chancellor Angela Merkel to discuss the path to resuming negotiations for a return to the Iran nuclear deal and their shared concerns about the state of Iran's nuclear program. On October 31, President Biden held a bilateral meeting with Turkish President Recep Tayyip Erdoğan and hosted event on global supply chain resilience through the pandemic and recovery on the margins of G20."
  ],
  [
    75,
    652,
    "2021-11-01,2021-11-02",
    "Participated in COP26. Met with British Prime Minister Boris Johnson and UN Secretary-General António Guterres. Held a bilateral meeting with Indonesian President Joko Widodo. On November 2, delivered remarks on U.S. plan to preserve global forests at the Action on Forests and Land-Use. Participated a meeting on Build Back Better World. Also delivered remarks on highlighting the progress of the Global Methane Pledge."
  ]
]
