[
  [
    73,
    21,
    "Traveled with Defense Secretary Lloyd Austin. Met with Foreign Minister Toshimitsu Motegi and Defense Minister Nobuo Kishi in a \"2+2\" meeting. Also met with Prime Minister Yoshihide Suga.",
    "March 15–17, 2021"
  ],
  [
    73,
    22,
    "Traveled with Defense Secretary Austin. Met with Foreign Minister Chung Eui-yong and Defense Minister Suh Wook in a \"2+2\" meeting. Also met with President Moon Jae-in.",
    "March 17–18, 2021"
  ],
  [
    73,
    40,
    "Met with Foreign Minister Sophie Wilmès, President of the European Commission Ursula von der Leyen, High Representative of the European Union Josep Borrell and NATO Secretary General Jens Stoltenberg. Also attended a NATO Foreign Ministerial meeting.",
    "March 22–25, 2021"
  ],
  [
    73,
    40,
    "Traveled with Defense Secretary Austin to consult with NATO Allies and partners on a range of shared priorities. Held bilateral and multilateral meetings with European counterparts to discuss key priorities and shared challenges.",
    "April 13–15, 2021"
  ],
  [
    73,
    155,
    "Met with President Ashraf Ghani and Chairman of the High Council for National Reconciliation, Abdullah Abdullah.",
    "April 15, 2021"
  ],
  [
    73,
    10,
    "Attended the G7 Foreign and Development Ministers’ Meeting. Met separately with Foreign Secretary Dominic Raab and Prime Minister Boris Johnson, as well as Foreign Minister Toshimitsu Motegi of Japan and Foreign Minister Chung Eui-yong of South Korea.",
    "May 3–5, 2021"
  ],
  [
    73,
    213,
    "Met with President Volodymyr Zelensky and Foreign Minister Dmytro Kuleba.",
    "May 5–6, 2021"
  ],
  [
    73,
    122,
    "Met with Queen Margrethe II, Crown Prince Frederik, Prime Minister Mette Frederiksen and Foreign Minister Jeppe Kofod.",
    "May 16–17, 2021"
  ],
  [
    73,
    44,
    "Met with President Guðni Th. Jóhannesson, Prime Minister Katrín Jakobsdóttir and Foreign Minister Guðlaugur Þór Þórðarson. Also attended the Arctic Council Ministerial meeting to discuss key priorities and address the threats of the climate crisis.",
    "May 17–20, 2021"
  ],
  [
    73,
    651,
    "Met with Prime Minister Múte Bourup Egede and Foreign Minister Pele Broberg.",
    "May 20, 2021"
  ],
  [73, 27, "Met with Foreign Minister Simon Coveney.", "May 24, 2021"],
  [
    73,
    51,
    "Met with President Reuven Rivlin, Prime Minister Benjamin Netanyahu and Foreign Minister Gabi Ashkenazi.",
    "May 25–26, 2021"
  ],
  [
    73,
    151,
    "Met with President Mahmoud Abbas and Prime Minister Mohammad Shtayyeh.",
    "May 25, 2021"
  ],
  [
    73,
    50,
    "Met with President Abdel Fattah el-Sisi and Foreign Minister Sameh Shoukry.",
    "May 26, 2021"
  ],
  [
    73,
    52,
    "Met with King Abdullah II and Foreign Minister Ayman Safadi.",
    "May 26–27, 2021"
  ],
  [
    73,
    18,
    "Met with President Carlos Alvarado Quesada and Foreign Minister Rodolfo Solano. Also attended a Central American Integration System (SICA) meeting.",
    "June 1–2, 2021"
  ],
  [
    73,
    10,
    " Carbis BayAccompanied President Biden to the 47th G7 summit in Cornwall. Also met with Foreign Secretary Dominic Raab of the United Kingdom and Foreign Minister Chung Eui-yong of South Korea.",
    "June 10–12, 2021"
  ],
  [
    73,
    40,
    "Accompanied President Biden to the 31st NATO summit and the EU–U.S. summit. Also participated in a signing ceremony with Prime Minister Edi Rama on 4G and 5G security",
    "June 12–15, 2021"
  ],
  [
    73,
    39,
    "Accompanied President Biden to the summit meeting with President Vladimir Putin. Also met with President Guy Parmelin and Foreign Minister Ignazio Cassis.",
    "June 16, 2021"
  ],
  [
    73,
    149,
    "Met with Chancellor Angela Merkel and Foreign Minister Heiko Maas. Also attended the 2nd Berlin Conference on the 2021 Libyan general election.",
    "June 22–24, 2021"
  ],
  [
    73,
    6,
    "Met with President Emmanuel Macron, Foreign Minister Jean-Yves Le Drian and OECD Secretary General Mathias Cormann.",
    "June 24–27, 2021"
  ],
  [
    73,
    8,
    "Bari, MateraMet with President Sergio Mattarella, Prime Minister Mario Draghi and Foreign Minister Luigi Di Maio. Blinken co-chaired a meeting of the Global Coalition to Defeat ISIS and participated in a Syria Ministerial. Also attended the G20 Foreign Ministers' Meeting.",
    "June 27–29, 2021"
  ],
  [
    73,
    9,
    "Met with Pope Francis, Cardinal Pietro Parolin and Archbishop Paul Gallagher.",
    "June 28, 2021"
  ],
  [
    73,
    78,
    "Met with Prime Minister Narendra Modi, Minister of External Affairs S. Jaishankar and National Security Advisor Ajit Doval.",
    "July 26–28, 2021"
  ],
  [
    73,
    170,
    "Met with Sheikh Nawaf Al-Sabah, Prime Minister Sabah Al-Khalid Al-Sabah, Foreign Minister Ahmed Nasser Al-Mohammed Al-Sabah and Speaker Marzouq Al-Ghanim.",
    "July 28–29, 2021"
  ],
  [
    73,
    167,
    "Met with Sheikh Tamim bin Hamad Al Thani and Foreign Minister Mohammed bin Abdulrahman bin Jassim Al Thani.",
    "September 6–8, 2021"
  ],
  [
    73,
    136,
    "Met with Foreign Minister Heiko Maas and attend a Ministerial on Afghanistan.",
    "September 8, 2021"
  ],
  [
    73,
    6,
    "Attended the Organization for Economic Co-operation and Development (OECD) ministerial alongside U.S. Special Presidential Envoy for Climate John Kerry, U.S. Trade Representative Katherine Tai, Chair of the Council of Economic Advisers Cecilia Rouse, and Under Secretary of State for Economic Growth, Energy, and the Environment Jose W. Fernandez.",
    "October 4–6, 2021"
  ],
  [
    73,
    188,
    "Attended the U.S.–Mexico High Level Security Dialogue with Mexican counterparts.",
    "October 7–8, 2021"
  ],
  [
    73,
    132,
    "Met with President Guillermo Lasso and Foreign Minister Mauricio Montalvo.",
    "October 19, 2021"
  ],
  [
    73,
    17,
    "Met with President Iván Duque and Vice President Marta Lucía Ramírez.",
    "October 20–21 2021"
  ],
  [
    73,
    9,
    "Accompanied President Biden and met with Pope Francis at the Apostolic Palace.",
    "October 28, 2021"
  ],
  [
    73,
    8,
    "Accompanied President Biden to the 2021 G20 Rome summit.",
    "October 29–31 2021"
  ],
  [
    73,
    652,
    "Accompanied President Biden to the 2021 United Nations Climate Change Conference (COP26).",
    "November 1–2, 2021"
  ],
  [
    73,
    111,
    "Met with President Uhuru Kenyatta and Secretary Raychelle Omamo.",
    "November 15–18, 2021"
  ],
  [
    73,
    205,
    "Met with President Muhammadu Buhari, Vice President Yemi Osinbajo, and Foreign Minister Geoffrey Onyeama.",
    "November 18–19, 2021"
  ],
  [
    73,
    109,
    "Met with President Macky Sall and Foreign Minister Aïssata Tall Sall.",
    "November 19–20, 2021"
  ],
  [
    73,
    290,
    "Met with President Egils Levits, Prime Minister Arturs Krišjānis Kariņš, and Foreign Minister Edgars Rinkēvičs. Also attended the NATO Foreign Ministerial.",
    "November 29–30, 2021"
  ],
  [
    73,
    84,
    "Met with Prime Minister Magdalena Andersson and Foreign Minister Ann Linde. Also attended the Organization for Security and Co-operation in Europe (OSCE) Ministerial Council, during which he met with several counterparts from OSCE member states, including Ukrainian Foreign Minister Dmytro Kuleba and Russian Foreign Minister Sergey Lavrov.",
    "December 1–2, 2021"
  ],
  [
    73,
    198,
    "Attended the G7 Foreign and Development Ministers' Meeting.",
    "December 10–13, 2021"
  ],
  [
    73,
    161,
    "Met with President Joko Widodo and Foreign Minister Retno Marsudi.",
    "December 14–15, 2021"
  ],
  [
    73,
    88,
    "Met with Prime Minister Ismail Sabri Yaakob and Foreign Minister Saifuddin Abdullah.",
    "December 15–16, 2021"
  ],
  [
    73,
    213,
    "Met with President Volodymyr Zelensky and Foreign Minister Dmytro Kuleba.",
    "January 18–20, 2022"
  ],
  [
    73,
    149,
    "Met with Chancellor Olaf Scholz and Foreign Minister Annalena Baerbock. Also attended ministerial with the Transatlantic Quad Foreign Ministers.",
    "January 20–21, 2022"
  ],
  [
    73,
    39,
    "Met with Russian Foreign Minister Sergey Lavrov.",
    "January 21, 2022"
  ]
]
