[
    [
        71,
        188,
        "Discussed bilateral relations with President Enrique Pena Nieto and Foreign Minister Luis Videgaray. Was joined by Secretary of Homeland Security John Kelly.",
        "February 22–23, 2017"
    ],
    [
        71,
        21,
        "Met with Prime Minister Shinzo Abe and Foreign Minister Fumio Kishida",
        "March 15–16, 2017"
    ],
    [71, 630, "Attended a G-7 Foreign Ministers’ Meeting.", "April 9–11, 2017"],
    [
        71,
        629,
        "Met with Foreign Minister Sergey Lavrov and President Vladimir Putin.",
        "April 11–13, 2017"
    ],
    [71, 53, "Accompanied President Trump.", "May 20–22, 2017"],
    [71, 51, "Accompanied President Trump.", "May 22–23, 2017"],
    [71, 172, "Accompanied President Trump.", "May 23, 2017"],
    [71, 8, "Accompanied President Trump.", "May 23–24, 2017"],
    [71, 9, "Accompanied President Trump.", "May 24, 2017"],
    [
        71,
        631,
        "Accompanied President Trump to the G-7 Economic Summit.",
        "May 25–26, 2017"
    ],
    [
        71,
        10,
        "Met with Foreign Secretary Boris Johnson. Signed book of condolences for the Manchester terrorist attack.",
        "May 26, 2017"
    ],
    [
        71,
        118,
        "Attended the Australia-U.S. Ministerial Consultations.",
        "June 5–6, 2017"
    ],
    [
        71,
        56,
        "Met with Prime Minister Bill English and Foreign Minister Gerry Brownlee.",
        "June 6–7, 2017"
    ],
    [
        71,
        546,
        "Accompanied President Trump to the G - 20 Summit.",
        "July 5– 9, 2017"
    ],
    [
        71,
        102,
        "Met with President Recep Erdogan and Foreign Minister Mevlut Cavusoglu.",
        "July 9– 10, 2017"
    ],
    [71, 213, "Met with President Petro Poroshenko.", "July 9, 2017"],
    [
        71,
        170,
        "Met with Emir Sheikh Sabah al - Ahmad al - Sabah and senior Kuwaiti officials.",
        "July 10– 11, 2017"
    ],
    [
        71,
        167,
        "Met with Emir Sheikh Tamim bin Hamad al - Thani and Foreign Minister Sheikh Mohammed bin Abdulrahman al - Thani.Signed MOU to prevent financing of terrorism.",
        "July 11, 2017"
    ],
    [
        71,
        120,
        "Met with King Salman bin Abdulaziz al - Saud, Crown Prince Mohammed bin Salman, and the Foreign Ministers of Saudi Arabia, Bahrain, the United Arab Emirates, and Egypt.",
        "July 11– 12, 2017"
    ],
    [
        71,
        170,
        "Met with Foreign Minister Sabah al - Khalid al - Sabah.",
        "July 12– 13, 2017"
    ],
    [71, 167, "Met with Emir Tamim bin Hamad al - Thani.", "July 13, 2017"],
    [
        71,
        55,
        "Attended the U.S. - ASEAN Ministerial Meeting.",
        "August 6– 8, 2017"
    ],
    [
        71,
        76,
        "Met with Prime Minister Prayut Chan - o - Cha and Foreign Minister Don Pramudwinai.",
        "August 8, 2017"
    ],
    [71, 88, "Met with Deputy Prime Minister Zahid Hamidi.", "August 8– 9, 2017"],
    [
        71,
        10,
        "Attended a Six-Party Ministerial meeting on Libya. Met with Prime Minister Theresa May.",
        "September 14, 2017"
    ],
    [
        71,
        24,
        "Met with President Xi Jinping, Foreign Minister Wang Yi, and State Councilor Yang Jiechi.",
        "September 30–October 1, 2017"
    ],
    [
        71,
        53,
        "Met with King Salman bin Abdulaziz al-Saud, Crown Prince Mohammed bin Salman, and Foreign Minister Adel al-Jubeir. Attended the first meeting of the Saudi Arabia-Iraq Coordination Council.",
        "October 21–22, 2017"
    ],
    [
        71,
        167,
        "Met with Emir Sheikh Tamim bin Hamad al - Thani and Foreign Minister Sheikh Mohammed bin Abdulrahman bin Jassim al - Thani.",
        "October 22– 23, 2017"
    ],
    [71, 144, "Met with President Ashraf Ghani.", "October 23, 2017"],
    [71, 168, "Met with Prime Minister Haidar al - Abadi.", "October 23, 2017"],
    [71, 79, "Met with senior Pakistani officials.", "October 24, 2017"],
    [
        71,
        78,
        "Met with Prime Minister Narendra Modi and Foreign Minister Sushma Swaraj.",
        "October 25, 2017"
    ],
    [
        71,
        39,
        "Met with UN Special Envoy Staffan de Mistura, UN High Commissioner for Refugees Filippo Grandi, and International Committee of the Red Cross President Peter Maurer.",
        "October 26, 2017"
    ],
    [71, 21, "Accompanied President Trump.", "November 5–7, 2017"],
    [71, 22, "Accompanied President Trump.", "November 5– 8, 2017"],
    [71, 24, "Accompanied President Trump.", "November 8– 10, 2017"],
    [
        71,
        29,
        "Accompanied President Trump to an APEC Meeting.",
        "November 10– 12, 2017"
    ],
    [
        71,
        55,
        "Accompanied President Trump to ASEAN Summit Meetings.",
        "November 12– 14, 2017"
    ],
    [
        71,
        140,
        "Met with State Councilor Aung San Suu Kyi and Commander - in -Chief Min Aung Hlang.",
        "November 15, 2017"
    ],
    [
        71,
        40,
        "Attended a NATO Foreign Ministers Meeting and met with EU Foreign Ministers.",
        "December 4– 6, 2017"
    ],
    [
        71,
        107,
        "Attended an OSCE Ministerial Council Meeting.",
        "December 7, 2017"
    ],
    [
        71,
        6,
        "Attended the International Support Group for Lebanon Ministerial Meeting and met with President Emmanuel Macron and Foreign Minister Jean - Yves Le Drian.",
        "December 8, 2017"
    ],
    [
        71,
        1,
        "Met with President Justin Trudeau and Foreign Minister Chrystia Freedland.",
        "December 19, 2017"
    ],
    [
        71,
        184,
        "Co - hosted the Vancouver Foreign Ministers’ Meeting on Security and Stability on the Korean Peninsula with Canadian Foreign Minister Chrystia Freeland.",
        "January 15– 17, 2018"
    ],
    [
        71,
        10,
        "Met with Prime Minister Theresa May, Foreign Secretary Boris Johnson, and National Security Advisor Mark Sedwill.",
        "January 21–22, 2018"
    ],
    [
        71,
        6,
        "Met with senior French officials and attended the launch of the International Partnership against Impunity for the Use of Chemical Weapons.",
        "January 23– 24, 2018"
    ],
    [71, 427, "Attended the 2018, World Economic Forum.", "January 24–26, 2018"],
    [
        71,
        143,
        "Discussed bilateral relations with senior Polish officials.",
        "January 26– 27, 2018"
    ],
    [
        71,
        188,
        "Met with President Enrique Peña Nieto and Foreign Secretary Luis Videgaray.",
        "February 1– 2, 2018"
    ],
    [
        71,
        65,
        "Met with President Mauricio Macri and Foreign Minister Jorge Faurie.",
        "February 3– 4, 2018"
    ],
    [
        71,
        194,
        "Met with President Pedro Pablo Kuczynski and Foreign Minister Cayetana Aljovin.",
        "February 5– 6, 2018"
    ],
    [
        71,
        17,
        "Met with President Juan Manuel Santos and Foreign Minister Maria Angela Holguin.",
        "February 6, 2018"
    ],
    [
        71,
        4,
        "Met with Prime Minister Andrew Holness and Foreign Minister Kamina Johnson - Smith.",
        "February 7, 2018"
    ],
    [71, 50, "Met with senior Egyptian officials.", "February 12, 2018"],
    [
        71,
        170,
        "Led the U.S.delegation to the Ministerial meeting of the Global Coalition to Defeat ISIS in Kuwait and participated in the Iraq Reconstruction Conference.",
        "February 12– 13, 2018"
    ],
    [
        71,
        52,
        "Met with King Abdullah II and Jordanian Foreign Minister Ayman al - Safadi.",
        "February 14, 2018"
    ],
    [
        71,
        72,
        "Met with Lebanese President Michel Aoun, Prime Minister Saad Hariri, and Speaker of Parliament Nabih Berri.",
        "February 15, 2018"
    ],
    [71, 67, "Met with senior Turkish officials.", "February 15– 16, 2018"],
    [
        71,
        632,
        "Met With Djiboutian President Ismaïl Omar Guelleh and Foreign Minister Mahamoud Ali Youssouf.",
        "March 9, 2018"
    ],
    [
        71,
        111,
        "Met with Kenyan President Uhuru Kenyatta and Foreign Minister Monica Juma.",
        "March 9–11, 2018"
    ],
    [
        71,
        633,
        "Met with Chadian President Idriss Deby and Foreign Minister Mahamat Zene Cherif.",
        "March 12, 2018"
    ],
    [
        71,
        205,
        "Met with Nigerian President Muhammadu Buhari and Foreign Minister Geoffrey Onyeama.",
        "March 12, 2018"
    ],
    [72, 40, "Attended a NATO Foreign Ministers’ Meeting.", "April 26– 27, 2018"],
    [
        72,
        53,
        "Met with Saudi Foreign Minister Adel al - Jubeir.",
        "April 28– 29, 2018"
    ],
    [
        72,
        75,
        "Met with Israeli Prime Minister Benjamin Netanyahu.",
        "April 29, 2018"
    ],
    [
        72,
        52,
        "Met with King Abdullah II and Jordanian Foreign Minister Ayman al - Safadi.Also met with Japanese Foreign Minister Taro Kono.",
        "April 30, 2018"
    ],
    [
        72,
        482,
        "Met with Chairman Kim Jong - un and other North Korean Government officials.Also secured the release of three Americans.",
        "May 8– 9, 2018"
    ],
    [
        72,
        634,
        "Accompanied President Trump to the G– 7 meetings.",
        "June 9, 2018"
    ],
    [
        72,
        89,
        "Participated in the President’ s summit with North Korean leader Kim Jong - un and bilateral events with Singaporean Prime Minister Lee Hsien Loong.",
        "June 10– 13, 2018"
    ],
    [
        72,
        22,
        "Met with senior Korean and Japanese officials to discuss the U.S. - Republic of Korea alliance, the U.S. - Japan alliance, and next steps in our shared approach to North Korea.",
        "June 13– 14, 2018"
    ],
    [
        72,
        24,
        "Met with Chinese officials on bilateral, regional, and global issues that affect both countries.",
        "June 14, 2018"
    ],
    [
        72,
        482,
        "Continued consultations and implementation of the forward progress made by President Trump and Chairman Kim in Singapore.",
        "July 5– 7, 2018"
    ],
    [
        72,
        21,
        "Met with Japanese and South Korean leaders to discuss our shared commitment to the final, fully verified denuclearization of the DPRK, as well as other bilateral and regional issues.",
        "July 7– 8, 2018"
    ],
    [
        72,
        219,
        "Met with senior Vietnamese officials to discuss our shared commitment to the final, fully verified denuclearization of the DPRK and other bilateral and regional issues.",
        "July 8– 9, 2018"
    ],
    [72, 155, "Met with Afghan officials.", "July 9, 2018"],
    [
        72,
        166,
        "Met with UAE leaders to discuss ways to further strengthen the U.S. - UAE partnership.",
        "July 9– 10, 2018"
    ],
    [
        72,
        40,
        "Accompanied President Trump to the NATO Summit and also participated in the U.S. - EU Energy Council and co - hosted a meeting of foreign ministers of the Global Coalition to Defeat ISIS.",
        "July 10– 12, 2018"
    ],
    [
        72,
        188,
        "Met with President Enrique Peña Nieto, Foreign Secretary Luis Videgaray Caso, and President - elect Andres Manuel Lopez Obrador.",
        "July 13, 2018"
    ],
    [
        72,
        47,
        "Accompanied President Trump to his meeting with Russian President Vladimir Putin.Also met with Russian Foreign Minister Sergey Lavrov and Finnish Foreign Minister Timo Soini, to discuss bilateral and regional issues.",
        "July 16, 2018"
    ],
    [
        72,
        88,
        "Met with senior Malaysian officials to discuss strengthening the Comprehensive Partnership and advancing common security and economic interests.",
        "August 1– 3, 2018"
    ],
    [
        72,
        89,
        "Participated in annual ASEAN - centered ministerial meetings.",
        "August 3– 4, 2018"
    ],
    [
        72,
        90,
        "Met with senior Indonesian officials to discuss U.S. - Indonesia Strategic Partnership.",
        "August 4– 5, 2018"
    ],
    [
        72,
        79,
        "Met with Prime Minister Imran Khan, Foreign Minister Qureshi, and Chief of Army Staff Qamar Javed Bajwa to discuss U.S. - Pakistan bilateral relations.",
        "September 5, 2018"
    ],
    [
        72,
        78,
        "Participated in the inaugural U.S. - India“ 2 + 2” dialogue and met with senior officials.",
        "September 6, 2018"
    ],
    [
        72,
        21,
        "Met with Prime Minister Shinzo Abe and Foreign Minister Taro Kono.",
        "October 6– 7, 2018"
    ],
    [72, 482, "Met with Chairman Kim Jong - un.", "October 7, 2018"],
    [
        72,
        22,
        "Met with President Moon Jae - in , and Foreign Minister Kang Kyung - wha.",
        "October 7– 8, 2018"
    ],
    [
        72,
        24,
        "Met with Chinese counterparts to discuss bilateral, regional, and global issues.",
        "October 8, 2018"
    ],
    [
        72,
        53,
        "Met with Crown Prince Mohammed bin Salman and Foreign Minister Adel al - Jubeir regarding the investigation into the disappearance of Jamal Khashoggi.",
        "October 15– 17, 2018"
    ],
    [
        72,
        134,
        "Met with President Juan Carlos Varela and Vice President and Foreign Minister Isabel de Saint Malo de Alvarado to discuss ongoing U.S. - Panama collaboration on regional priorities.",
        "October 18, 2018"
    ],
    [
        72,
        188,
        "Met with President Enrique Peña Nieto, Foreign Secretary Luis Videgaray Caso, and Foreign Secretary - designate Marcelo Luis Ebrard Casaubon.",
        "October 19, 2018"
    ],
    [
        72,
        6,
        "Joined President Trump in commemorating the 100 th anniversary of the end of the WWI.Also participated in the President’ s meeting with French President Emmanuel Macron.",
        "November 10– 11, 2018"
    ],
    [
        72,
        65,
        "Supported President Trump’ s participation in the G20 Leaders’ Summit.",
        "November 29-December 1, 2018"
    ],
    [
        72,
        40,
        "Participated in the semi - annual meeting of NATO Foreign Ministers and also met with Belgian Prime Minister Charles Michel.",
        "December 3– 5, 2018"
    ],
    [
        72,
        101,
        "Met with Prime Minister Orbán and Foreign Minister Szijjártó.",
        "February 11, 2019"
    ],
    [
        72,
        490,
        "Met with President Kiska, Prime Minister Pellegrini, and Foreign Minister Lajčák.",
        "February 12, 2019"
    ],
    [72, 143, "Met with Foreign Minister Czaputowicz.", "February 12, 2019"],
    [
        72,
        40,
        "Met with EU High Representative for Foreign Affairs and Security Policy Federica Mogherini.",
        "February 13– 14, 2019"
    ],
    [
        72,
        44,
        "Met with Prime Minister Jakobsdóttir and Foreign Minister Thórdarson.",
        "February 15, 2019"
    ],
    [
        72,
        219,
        "Participated in the President’ s summit with North Korean leader Kim Jong - un and bilateral meetings with Vietnamese leaders.",
        "February 24– 28, 2019"
    ],
    [
        72,
        55,
        "Met with President Rodrigo Duterte and Secretary of Foreign Affairs Teodoro Locsin, Jr.",
        "February 28-March 1, 2019"
    ],
    [
        72,
        170,
        "Led the U.S.delegation at the third U.S. - Kuwait Strategic Dialogue.",
        "March 18– 20, 2019"
    ],
    [
        72,
        51,
        "Met with Israeli officials to engage on critical regional issues.",
        "March 20– 21, 2019"
    ],
    [
        72,
        72,
        "Met with Lebanese leaders to discuss political, security, economic, and humanitarian challenges.",
        "March 22– 23, 2019"
    ],
    [
        72,
        158,
        "Met with President Piñera and Foreign Minister Ampuero.",
        "April 12, 2019"
    ],
    [
        72,
        456,
        "Met with President Abdo Benítez and Foreign Minister Castiglioni.",
        "April 13, 2019"
    ],
    [
        72,
        194,
        "Met with President Vizcarra and Foreign Minister Popolizio.",
        "April 13, 2019"
    ],
    [
        72,
        635,
        "Visited entities supporting Venezuelan refugees and assessed the challenges due to the closed border.",
        "April 14, 2019"
    ],
    [
        72,
        636,
        "Participated in the Eleventh Ministerial Meeting of the Arctic Council and delivered a speech on U.S.Arctic policy.",
        "May 6, 2019"
    ],
    [
        72,
        168,
        "Met with Iraqi Prime Minister Adil Abd al - Mahdi and Iraqi President Barham Salih.",
        "May 7, 2019"
    ],
    [
        72,
        10,
        "Met with Prime Minister Theresa May and Foreign Secretary Jeremy Hunt to discuss shared global priorities, and gave a speech on the U.S.‑UK Special Relationship.",
        "May 8, 2019"
    ],
    [
        72,
        40,
        "Met with European allies to discuss recent threatening actions and statements by the Islamic Republic of Iran.",
        "May 13– 14, 2019"
    ],
    [
        72,
        637,
        "Met with Russian Foreign Minister Sergey Lavrov and President Vladimir Putin.",
        "May 14, 2019"
    ],
    [
        72,
        149,
        "Met with Chancellor Angela Merkel and Foreign Minister Heiko Maas.",
        "May 30-June 1, 2019"
    ],
    [
        72,
        491,
        "Met with Foreign Minister Ignazio Cassis, Swiss business leaders, and World Health Organization Director General Dr.Tedros Adhanom Ghebreyesus.",
        "June 1– 3, 2019"
    ],
    [
        72,
        71,
        "Participated in the opening of the Global Entrepreneurship Summit with Prime Minister Mark Rutte and met with Foreign Minister Stef Blok.",
        "June 3, 2019"
    ],
    [
        72,
        10,
        "Joined President Trump's state visit to the United Kingdom.",
        "June 3–5, 2019"
    ],
    [
        72,
        120,
        "Met with King Salman bin Abdulaziz Al Saud and Crown Prince Mohammed bin Salman Al Saud.",
        "June 23– 24, 2019"
    ],
    [
        72,
        166,
        "Met with Crown Prince Mohammed bin Zayed Al Nahyan.",
        "June 24, 2019"
    ],
    [
        72,
        155,
        "Met with President Ashraf Ghani, Chief Executive Abdullah Abdullah, former President Hamid Karzai, and others to discuss next steps in the Afghan Peace Process.",
        "June 25, 2019"
    ],
    [
        72,
        78,
        "Met with Prime Minister Narendra Modi and Minister of External Affairs S.Jaishankar to discuss the U.S. - India strategic partnership.",
        "June 25– 26, 2019"
    ],
    [72, 405, "Participated in the G– 20 Leaders’ Summit.", "June 28– 30, 2019"],
    [
        72,
        22,
        "Joined President Trump’ s meeting with President Moon Jae - in .",
        "June 30, 2019"
    ],
    [
        72,
        65,
        "Joined regional lead-for the Second Western Hemisphere Counterterrorism Ministerial.",
        "July 19, 2019"
    ],
    [
        72,
        94,
        "Met with President Lenín Moreno and Foreign Minister José Valencia.",
        "July 20, 2019"
    ],
    [72, 188, "Met with Foreign Secretary Marcelo Ebrard.", "July 21, 2019"],
    [72, 86, "Met with President Nayib Bukele.", "July 21, 2019"],
    [
        72,
        76,
        "Co - chaired the U.S. - Association of Southeast Asian Nations(ASEAN) Ministerial and held a bilateral meeting with Foreign Minister Don Pramudwinai.",
        "August 1– 2, 2019"
    ],
    [
        72,
        118,
        "Led the U.S.delegation to the Australia - United States Ministerial Consultations and met with Prime Minister Scott Morrison.",
        "August 4– 5, 2019"
    ],
    [
        72,
        638,
        "Met with the leaders of the Federated States of Micronesia, the Republic of the Marshall Islands, and the Republic of Palau in the first - ever visit by a Secretary of State to the Federated States of Micronesia.",
        "August 5, 2019"
    ],
    [
        72,
        1,
        "Met with Prime Minister Justin Trudeau and Foreign Minister Chrystia Freeland.",
        "August 22, 2019"
    ],
    [
        72,
        40,
        "Met with Belgian Prime Minister and European Council President - elect Michel, NATO Secretary General Stoltenberg, European Parliament President Sassoli, European Commission President - elect von der Leyen, and Acting Spanish Foreign Minister Josep Borrell.",
        "September 2– 3, 2019"
    ],
    [
        72,
        120,
        "Met with Saudi Crown Prince Mohammed bin Salman Al Saud.",
        "September 18, 2019"
    ],
    [
        72,
        166,
        "Met with Crown Prince Mohammed bin Zayed Al Nahyan.",
        "September 19, 2019"
    ],
    [
        72,
        8,
        "Met with President Sergio Mattarella, Prime Minister Giuseppe Conte, and Foreign Minister Luigi Di Maio.",
        "October 2, 2019"
    ],
    [
        72,
        639,
        "Audience with His Holiness Pope Francis and met with Secretary of State Cardinal Pietro Parolin.",
        "October 2– 3, 2019"
    ],
    [
        72,
        640,
        "Met with President Milo Djukanovic, Prime Minister Dusko Markovic, and Foreign Minister Srdjan Darmanovic.",
        "October 4, 2019"
    ],
    [
        72,
        68,
        "Met with Prime Minister Kyriakos Mitsotakis, Foreign Minister Nikos Dendias, and Defense Minister Nikolaos Panagiotopoulos.",
        "October 5, 2019"
    ],
    [
        72,
        67,
        "Participated in a meeting with Vice President Mike Pence and Turkish President Recep Tayyip Erdoğan to discuss the situation in northeast Syria.",
        "October 17, 2019"
    ],
    [
        72,
        51,
        "Met with Prime Minister Benjamin Netanyahu to discuss developments in Syria.",
        "October 18, 2019"
    ],
    [
        72,
        40,
        "Met with NATO Secretary General Jens Stoltenberg.",
        "October 18, 2019"
    ],
    [
        72,
        545,
        "Participated in events to commemorate the end of the Cold War and met with German Foreign Minister Heiko Maas.",
        "November 6, 2019"
    ],
    [
        72,
        149,
        "Met with German Chancellor Angela Merkel and commemorated the 30 th anniversary of the fall of the Berlin Wall.",
        "November 7– 8, 2019"
    ],
    [
        72,
        40,
        "Led the U.S.delegation to the NATO Foreign Ministerial.",
        "November 19– 21, 2019"
    ],
    [
        72,
        10,
        "Joined U.S.delegation led by President Trump to attend the NATO Leaders Meeting.",
        "December 3– 4, 2019"
    ],
    [
        72,
        38,
        "Met with Prime Minister António Costa and Foreign Minister Augusto Santos Silva.",
        "December 4– 5, 2019"
    ],
    [72, 83, "Met with senior government officials.", "December 5, 2019"],
    [
        72,
        149,
        "Attended the jointly hosted German - UN international conference on Libya.",
        "January 19, 2020"
    ],
    [
        72,
        17,
        "Addressed the Third Western Hemisphere Counterterrorism Ministerial and met with President Duque and other regional leaders.",
        "January 20, 2020"
    ],
    [
        72,
        18,
        "Met with President Carlos Alvarado and visited the Joint Operations Center.",
        "January 21, 2020"
    ],
    [
        72,
        4,
        "Met with Prime Minister Holness, conducted a multilateral roundtable discussion with Caribbean leaders, and delivered remarks on U.S. - Caribbean relations.",
        "January 21– 23, 2020"
    ],
    [
        72,
        10,
        "Met with U.K.Prime Minister Boris Johnson and U.K.Foreign Secretary Dominic Raab.",
        "January 29, 2020"
    ],
    [
        72,
        213,
        "Met with President Zelenskyy, Foreign Minister Prystaiko, and Defense Minister Zahorodnyuk.",
        "January 30, 2020"
    ],
    [
        72,
        351,
        "Met with President Lukashenka and Foreign Minister Makei.",
        "February 1, 2020"
    ],
    [
        72,
        641,
        "Met with Kazakhstani President Tokayev, First President Nazarbayev, and Foreign Minister Tileuberdi.",
        "February 1– 2, 2020"
    ],
    [
        72,
        228,
        "Met with President Mirziyoyev and Foreign Minister Kamilov.Participated in a C5 + 1 Ministerial with the foreign ministers of Kazakhstan, the Kyrgyz Republic, Tajikistan, Turkmenistan, and Uzbekistan.",
        "February 2– 3, 2020"
    ],
    [
        72,
        138,
        "Led the U.S.delegation to the Munich Security Conference.",
        "February 14, 2020"
    ],
    [
        72,
        109,
        "Met with President Macky Sall and Foreign Minister Amadou Ba.",
        "February 15– 16, 2020"
    ],
    [
        72,
        202,
        "Met with President Joao Lourenço and Foreign Minister Manuel Augusto.",
        "February 17, 2020"
    ],
    [
        72,
        137,
        "Met with Prime Minister Abiy Ahmed and President Sahle - Work Zewde.Also met with African Union Commission Chairperson Moussa Faki Mahamat.",
        "February 17– 19, 2020"
    ],
    [
        72,
        53,
        "Discussed regional and bilateral issues with Saudi leadership.",
        "February 19– 21, 2020"
    ],
    [
        72,
        169,
        "Met with Sultan Haitham bin Tarik and expressed his condolences on the death of Oman’ s Sultan Qaboos bin Said.",
        "February 21, 2020"
    ],
    [
        72,
        167,
        "Met with Qatari Amir Sheikh Tamim bin Hamad Al Thani and Foreign Minister Sheikh Mohammad bin Abdulrahman Al Thani.Attended the signing of the U.S. - Taliban Peace Deal.",
        "February 28–March 1, 2020"
    ],
    [
        72,
        155,
        "Met with Afghan President Ashraf Ghani and Afghan Security Ministers.",
        "March 23, 2020"
    ],
    [72, 167, "Met with Taliban officials.", "March 23, 2020"],
    [
        72,
        51,
        "Met with Prime Minister Benjamin Netanyahu and Speaker of the Knesset Benny Gantz.",
        "May 13, 2020"
    ],
    [
        72,
        10,
        "Met with Prime Minister Boris Johnson and Foreign Secretary Dominic Raab.",
        "July 20– 22, 2020"
    ],
    [
        72,
        122,
        "Met with Danish Prime Minister Mette Frederiksen.Also met with Danish Minister of Foreign Affairs Jeppe Koford, Faroese Minister of Foreign Affairs and Education Jenis av Rana, and Greenlandic Minister of Foreign Affairs and Energy Steen Lynge.",
        "July 22, 2020"
    ],
    [
        72,
        164,
        "Joined Foreign Minister Petricek in Pilsen to commemorate the liberation of Western Czechoslovakia.In Prague, met with Prime Minister Babis and had a courtesy call with President Zeman.",
        "August 11– 12, 2020"
    ],
    [
        72,
        422,
        "Met with President Pahor and Prime Minister Jansa.",
        "August 13, 2020"
    ],
    [
        72,
        107,
        "Met with Foreign Minister Schallenberg and Chancellor Kurz.Also met with IAEA Director General Grossi.",
        "August 14, 2020"
    ],
    [
        72,
        143,
        "Met with Prime Minister Morawiecki and Foreign Minister Czaputowicz.Also met with President Duda.",
        "August 15, 2020"
    ],
    [
        72,
        106,
        "Led the U.S.delegation to the presidential inauguration of Luis Abinader.",
        "August 16, 2020"
    ],
    [
        72,
        51,
        "Met with Prime Minister Benjamin Netanyahu.",
        "August 23– 24, 2020"
    ],
    [
        72,
        437,
        "Met with Prime Minister Abdalla Hamdok and Sovereign Council Chair General Abdel Fattah el - Burhan.",
        "August 25, 2020"
    ],
    [
        72,
        229,
        "Met with King Hamad Al Khalifa and Crown Prince Salman bin Hamad Al Khalifa.",
        "August 26, 2020"
    ],
    [
        72,
        166,
        "Met with Minister of Foreign Affairs and International Cooperation Sheikh Abdullah bin Zayed Al Nahyan.",
        "August 26, 2020"
    ],
    [72, 169, "Met with Sultan Haitham bin Tarik Al Said.", "August 27, 2020"],
    [
        72,
        167,
        "Attended the opening ceremony of Afghanistan peace negotiations.",
        "September 11– 12, 2020"
    ],
    [
        72,
        311,
        "Met with President Anastasiades and Foreign Minister Christodoulides.",
        "September 12, 2020"
    ],
    [72, 462, "Met with President Chan Santokhi.", "September 17, 2020"],
    [
        72,
        642,
        "Met with President Irfaan Ali and CARICOM Secretary - General Irwin LaRocque.",
        "September 18, 2020"
    ],
    [72, 643, "Met with Foreign Minister Ernesto Araujo.", "September 18, 2020"],
    [72, 17, "Met with Colombian President Ivan Duque.", "September 19, 2020"],
    [
        72,
        644,
        "Met with Prime Minister Mitsotakis and Foreign Minister Dendias.",
        "September 28– 29, 2020"
    ],
    [
        72,
        8,
        "Met with Prime Minister Conte and Foreign Minister Di Maio.",
        "September 30–October 1, 2020"
    ],
    [
        72,
        9,
        "Met with Secretary of State Cardinal Parolin and Secretary for Relations with States Archbishop Gallagher.",
        "September 30, 2020"
    ],
    [
        72,
        473,
        "Met with Prime Minister Plenković, Foreign Minister Grlić Radman, and Defense Minister Banožić.",
        "October 2, 2020"
    ],
    [
        72,
        21,
        "Met with Prime Minister Suga and participated in the second meeting of the Quad Foreign Ministers of Australia(Payne), India(Jaishankar), and Japan(Motegi).",
        "October 4– 6, 2020"
    ],
    [
        72,
        78,
        "Led, with Secretary of Defense Mark T.Esper, the third annual U.S. - India 2 + 2 Ministerial Dialogue.Met with Minister of External Affairs Subrahmanyam Jaishankar and Minister of Defense Rajnath Singh.",
        "October 25– 27, 2020"
    ],
    [
        72,
        442,
        "Met with President Rajapaksa and Foreign Minister Gunawardena.",
        "October 27– 28, 2020"
    ],
    [
        72,
        359,
        "Met with President Solih and Foreign Minister Abdulla Shahid.",
        "October 28, 2020"
    ],
    [
        72,
        90,
        "Met with President Joko Widodo and Foreign Minister Retno Marsudi.",
        "October 28– 29, 2020"
    ],
    [
        72,
        219,
        "Met with Prime Minister Phuc, Foreign Minister Minh, and Minister for Public Security Lam.",
        "October 29– 30, 2020"
    ],
    [
        72,
        6,
        "Met with President Macron and Foreign Minister Le Drian.",
        "November 13– 16, 2020"
    ],
    [
        72,
        102,
        "Met with His All Holiness the Ecumenical Patriarch of Constantinople, Bartholomew I.",
        "November 16, 2020"
    ],
    [
        72,
        217,
        "Met with President Zourabichvili, Prime Minister Gakharia, and Foreign Minister Zalkaliani.Also met with Patriarch of the Georgian Orthodox Church, Hi Holiness Ilia II.",
        "November 17– 18, 2020"
    ],
    [
        72,
        51,
        "Met with Prime Minister Benjamin Netanyahu and Foreign Minister Gabi Ashkenazi.Also held trilateral meeting with Prime Minister Netanyahu and Bahraini Foreign Minister Abdullatif bin Rashid Al Zayani.",
        "November 18– 19, 2020"
    ],
    [
        72,
        166,
        "Met with Abu Dhabi Crown Prince Mohammed bin Zayd.",
        "November 21, 2020"
    ],
    [
        72,
        167,
        "Met with Amir Tamim bin Hamad Al Thani and Deputy Prime Minister and Minister of Foreign Affairs Mohammed bin Abdulrahman Al Thani.Also met with delegations representing the Islamic Republic of Afghanistan and the Taliban in Afghanistan peace negotiations.",
        "November 21, 2020"
    ],
    [72, 53, "Met with Crown Prince Mohammed bin Salman.", "November 22, 2020"]
]