[
    [74, "2017-05-20,2017-05–22", 53, "Met with King Salman and Muslim leaders at the Riyadh Summit. Signed a $110 billion arms deal with Saudi Arabia."],
    [74, "2017-05-22,2017-05-23", 51, "Met with President Reuven Rivlin and Prime Minister Benjamin Netanyahu."],
    [74, "2017-05-23,", 172, "Met with Palestinian president Mahmoud Abbas."],
    [74, "2017-05-23,2017-05–24", 8, "Met with President Sergio Mattarella and Prime Minister Paolo Gentiloni."],
    [74, "2017-05-24,", 9, "Met with Pope Francis."],
    [74, "2017-05-24,2017-05–25", 40, "Met with King Philippe and Prime Minister Charles Michel. Attended the 28th NATO summit and the U.S.-EU Summit Meeting, where he also met with French president Emmanuel Macron."],
    [74, "2017-05-25,2017-05–27", 631, "Attended the 43rd G7 summit. Also held a bilateral meeting with Japanese prime minister Shinzō Abe."],
    [74, "2017-07-05,2017-07–06", 143, "Met with President Andrzej Duda and Croatian president Kolinda Grabar-Kitarovic. Attended the 2nd summit of the Three Seas Initiative."],
    [74, "2017-07-06,2017-07-08", 546, "Attended the G-20 summit.[17] Also held bilateral meetings with British prime minister Theresa May, Chinese president Xi Jinping, German chancellor Angela Merkel, Indonesian president Joko Widodo, Japanese prime minister Shinzō Abe, Mexican president Enrique Peña Nieto, Russian president Vladimir Putin and Singaporean prime minister Lee Hsien Loong."],
    [74, "2017-07-13,2017-07–14", 6, "Met with President Emmanuel Macron.Participated in the Bastille Day celebrations marking the 100th anniversary of the entry of the United States into World War I."],
    [74, "2017-11-05,2017-11–07", 21, "Met with Emperor Akihito and Prime Minister Shinzō Abe."],
    [74, "2017-11-07,2017-11–08", 165, "Met with South Korean president Moon Jae-in and addressed the South Korean National Assembly. Also met with troops from the Eighth United States Army at Camp Humphreys."],
    [74, "2017-11-08,2017-11–10,", 24, "Met with General Secretary and President Xi Jinping and Premier Li Keqiang."],
    [74, "2017-11-10,2017-11–12", 645, "Met with President Trần Đại Quang, Prime Minister Nguyễn Xuân Phúc and Communist Party general secretary Nguyễn Phú Trọng. Attended the APEC Vietnam 2017."],
    [74, "2017-11-12,2017-11–14", 55, "Attended the 31st ASEAN Summit. Met with President Rodrigo Duterte."],
    [74, "2018-01-25,2018-01-26", 427, "Attended the World Economic Forum; also held bilateral meetings with British prime minister Theresa May and Israeli prime minister Benjamin Netanyahu."],
    [74, "2018-06-08,2018-06-09", 646, "Attended the 44th G7 summit. Also held bilateral meetings with Canadian prime minister Justin Trudeau and French president Emmanuel Macron."],
    [74, "2018-06-10,2018-06-12", 89, "Attended the summit meeting with North Korean chairman Kim Jong-un, becoming the first sitting U.S.president to meet a North Korean leader. Also met with Prime Minister Lee Hsien Loong."],
    [74, "2018-07-10,2018-07-12", 40, "Attended the 29th NATO summit; also held bilateral meetings with NATO secretary general Jens Stoltenberg, French president Emmanuel Macron and German chancellor Angela Merkel."],
    [74, "2018-07-12,2018-07-15", 10, "Met with Queen Elizabeth II and Prime Minister Theresa May.Spent weekend at his Turnberry golf resort in Scotland."],
    [74, "2018-07-15,2018-07-16", 47, "Attended summit meeting with Russian President Vladimir Putin.Also met with President Sauli Niinistö."],
    [74, "2018-11-09,2018-11-11 ", 6, "Met with President Emmanuel Macron.Participated in the Armistice Day celebrations marking the 100 th anniversary of the Armistice with Germany that brought major hostilities of World War I to an end."],
    [74, "2018-11-29,2018-12-01 ", 65, "Attended the G - 20 summit.Also held bilateral meetings with Argentinian president Mauricio Macri, Australian prime minister Scott Morrison, Chinese president Xi Jinping, German chancellor Angela Merkel, Indian prime minister Narendra Modi, Japanese prime minister Shinzō Abe, South Korean president Moon Jae - in , and Turkish president Recep Tayyip Erdoğan."],
    [74, "2018-12-26,", 647, "Visited with U.S.military personnel serving in Western Iraq accompanied by First Lady Melania Trump."],
    [74, "2018-12-26,2018-12-27 ", 136, "Visited with United States Armed Forces serving in Rhineland - Palatinate, Germany."],
    [74, "2019-02-26,2019-02-28", 219, "Attended the summit meeting with North Korean chairman Kim Jong-un.Also met with General Secretary and President Nguyễn Phú Trọng and Prime Minister Nguyễn Xuân Phúc."],
    [74, "2019-05-25,2019-05-28", 160, "Met with Emperor Naruhito and Prime Minister Shinzō Abe."],
    [74, "2019-06-03,2019-06-05", 10, "Met with Queen Elizabeth II and Prime Minister Theresa May. Attended the 75th anniversary of D-Day commemorative ceremonies."],
    [74, "2019-06-05,2019-06-06", 27, "Met with Taoiseach Leo Varadkar. Spent one night at his International golf resort in Doonbeg."],
    [74, "2019-06-06,", 393, "Met with President Emmanuel Macron. Attended the 75th anniversary of D-Day memorial ceremonies."],
    [74, "2019-06-06,2019-06-07", 27, "Spent one night at his International golf resort in Doonbeg."],
    [74, "2019-06-27,2019-06-29", 405, "Attended the G-20 summit. Also held bilateral meetings with Australian prime minister Scott Morrison, Brazilian president Jair Bolsonaro, Chinese president Xi Jinping, German chancellor Angela Merkel, Indian prime minister Narendra Modi, Japanese prime minister Shinzō Abe, Saudi crown prince Mohammad Bin Salman, Turkish president Recep Tayyip Erdoğan, and Russian president Vladimir Putin."],
    [74, "2019-06-29,2019-06-30", 22, "Met with President Moon Jae-in. Visited the Korean Demilitarized Zone. Attended the Koreas–United States DMZ Summit with President Moon and North Korean chairman Kim Jong-un at the Inter-Korean Freedom House on the southern side of the Joint Security Area of the Korean Demilitarized Zone. Visited U.S.troops at Osan Air Base."],
    [74, "2019-06-30,", 648, "Briefly walked into the northern side of the Joint Security Area of the Korean Demilitarized Zone, accompanied by North Korean chairman Kim Jong-un, becoming the first sitting U.S.president to enter North Korea."],
    [74, "2019-08-24,2019-08-26,", 649, "Attended the 45th G7 summit. Also held bilateral meetings with Australian prime minister Scott Morrison, British prime minister Boris Johnson, Canadian prime minister Justin Trudeau, Egyptian president Abdel Fattah el-Sisi, French president Emmanuel Macron, German chancellor Angela Merkel, Indian prime minister Narendra Modi, and Japanese prime minister Shinzō Abe."],
    [74, "2019-11-28,", 144, "Visited with U.S.military personnel serving in Eastern Afghanistan accompanied by First Lady Melania Trump."],
    [74, "2019-12-02,2019-12-04", 10, "Attended the 30 th NATO summit.Met with Queen Elizabeth II and Prime Minister Boris Johnson. Also held bilateral meetings with Canadian prime minister Justin Trudeau, Danish prime minister Mette Frederiksen, French president Emmanuel Macron, German chancellor Angela Merkel and Italian prime minister Giuseppe Conte."],
    [74, "2020-01-21,2020-01-22", 427, "Davos Attended the World Economic Forum; also held bilateral meetings with European Commission president Ursula von der Leyen, Iraqi president Barham Salih, Iraqi Kurdish president Nechirvan Barzani, Pakistani prime minister Imran Khan, and Swiss president Simonetta Sommaruga."],
    [74, "2020-02-24,2020-02-25", 650, "Addressed a \"Namaste(Welcome) Trump\" event with Prime Minister Narendra Modi in Ahmedabad. Conducted a series of meetings with Modi and other government officials, as well as Indian business executives. Final international trip of the Trump presidency due to COVID-19 pandemic."]
]